app/controllers/answer_regist/corrects_controller.rb

INSERT INTO "corrects" ("correct", "stage") VALUES ($1, $2) RETURNING "stage"  [["correct", "D"], ["stage", 2]]
---
    def create
        @correct=Correct.new
        @correct.assign_attributes(correct_params)
        #print @correct.stage, @correct.correct
        @correct.save