app/controllers/welcome_controller.rb

SELECT MAX("answers"."stage") AS max_id FROM "answers"
---
    def index

        @users=User.find_by_sql("select user_id, user_name, count(*) as cnt , rank() over ( order by count(*) desc ) from answers left join corrects using (stage) left join users on answers.user_id = users.id  where answer = correct group by user_id, user_name order by cnt desc;")
        ans=Answer.find_by_sql("select stage, answer ,count(*) as cnt from answers group by stage, answer order by stage ,answer;")
        max=Answer.maximum('stage')